
#Область ПрограммныйИнтерфейс

&После("ПриОпределенииСправочниковДляЗагрузкиДанных")
Процедура fx_ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники) Экспорт
	
	Сведения = ЗагружаемыеСправочники.Найти("Справочник.УчебныеМатериалы", "ПолноеИмя");
	Если Сведения = Неопределено Тогда
		Сведения = ЗагружаемыеСправочники.Добавить();
		Сведения.ПолноеИмя = "Справочник.УчебныеМатериалы";
		Сведения.Представление = "Учебные материалы";
	КонецЕсли;
	Сведения.ПрикладнаяЗагрузка = Истина;
	
КонецПроцедуры

#КонецОбласти